solution_verification/simplified_edds_model/interface_energy_consistency/simulation_setup/template/system/pipeFluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/pipeFluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        smoother         GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance        1e-7;
        relTol           0;
    }
    
    rho
    {
        solver           PBiCGStab;          // Solver for density
        preconditioner   DILU;               // Diagonal incomplete LU preconditioner
        tolerance        1e-7;               // Tolerance for density solve
        relTol           0.1;                // Relative tolerance
    }

    rhoFinal
    {
        $rho;                                // Reuse the settings for rho
        tolerance        1e-7;               // Final solve tolerance for rho
        relTol           0;                  // Relative tolerance for final solve
    }  

    "(U|h)"
    {
        solver           PBiCGStab;          // Solver for velocity field
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0.1;
    }

    "(U|h)Final"
    {
        $U;                                  // Reuse the settings from U
        tolerance        1e-7;
        relTol           0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        h              1;
        e              1;
        U              1;
    }
}


// ************************************************************************* //
