solution_verification/simplified_edds_model/interface_energy_consistency/simulation_setup/template/system/caseSolid/topoSetDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
	//Convert a cellZone into a cellSet
     {
	name   heatCellSet;
	type   cellZoneSet;
	action new;
	source zoneToCell;
	sourceInfo
	{
	    name  caseSolid;
	}

     }

);



